Ran Plan for 3 projects:

1. dir: `gcp/projects/jonpulsifer` workspace: `default`
1. dir: `gcp/projects/trusted-builds` workspace: `default`
1. dir: `gcp/projects/wishlist-4362e` workspace: `default`

### 1. dir: `gcp/projects/jonpulsifer` workspace: `default`
```diff

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d gcp/projects/jonpulsifer`
* :put_litter_in_its_place: To **delete** this plan click [here](http://21fe6e196cd2:8080/lock?id=jonpulsifer%252Fcloudlab%252Fgcp%252Fprojects%252Fjonpulsifer%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d gcp/projects/jonpulsifer`

---
### 2. dir: `gcp/projects/trusted-builds` workspace: `default`
```diff

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d gcp/projects/trusted-builds`
* :put_litter_in_its_place: To **delete** this plan click [here](http://21fe6e196cd2:8080/lock?id=jonpulsifer%252Fcloudlab%252Fgcp%252Fprojects%252Ftrusted-builds%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d gcp/projects/trusted-builds`

---
### 3. dir: `gcp/projects/wishlist-4362e` workspace: `default`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_dns_managed_zone.wishlist-app will be created
+ resource "google_dns_managed_zone" "wishlist-app" {
      + description  = "Domain for the wishlist app"
      + dns_name     = "wishin.app."
      + id           = (known after apply)
      + labels       = {
          + "domain"      = "wishlist-app"
          + "environment" = "production"
        }
      + name         = "wishlist-app"
      + name_servers = (known after apply)
      + project      = (known after apply)
      + visibility   = "public"
    }

  # google_project_iam_member.cert-manager will be created
+ resource "google_project_iam_member" "cert-manager" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:cert-manager@kubesec.iam.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/dns.admin"
    }

  # google_project_iam_member.external-dns will be created
+ resource "google_project_iam_member" "external-dns" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:external-dns@kubesec.iam.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/dns.admin"
    }

  # google_project_organization_policy.allow_production_services will be created
+ resource "google_project_organization_policy" "allow_production_services" {
      + constraint  = "serviceuser.services"
      + etag        = (known after apply)
      + id          = (known after apply)
      + project     = "wishlist-4362e"
      + update_time = (known after apply)
      + version     = (known after apply)

      + list_policy {
          + suggested_value = (known after apply)

          + allow {
              + all = true
            }
        }
    }

  # google_project_organization_policy.allow_service_accounts will be created
+ resource "google_project_organization_policy" "allow_service_accounts" {
      + constraint  = "iam.disableServiceAccountCreation"
      + etag        = (known after apply)
      + id          = (known after apply)
      + project     = "wishlist-4362e"
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = false
        }
    }

  # google_project_service.clouddns will be created
+ resource "google_project_service" "clouddns" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "dns.googleapis.com"
    }

  # google_service_account.wishlist will be created
+ resource "google_service_account" "wishlist" {
      + account_id   = "wishlist"
      + display_name = "Application service account"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_member.wishlist-workload-identity will be created
+ resource "google_service_account_iam_member" "wishlist-workload-identity" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:kubesec.svc.id.goog[wishlist/wishlist]"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d gcp/projects/wishlist-4362e`
* :put_litter_in_its_place: To **delete** this plan click [here](http://21fe6e196cd2:8080/lock?id=jonpulsifer%252Fcloudlab%252Fgcp%252Fprojects%252Fwishlist-4362e%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d gcp/projects/wishlist-4362e`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
